Revit.Elements.FaceWall
FaceWall Element

Revit.Elements.FaceWall.InternalFaceWall
Internal reference to the Revit Element

Revit.Elements.FaceWall.InternalElement
Reference to the Element

Revit.Elements.FaceWall.#ctor(Autodesk.Revit.DB.FaceWall)
Create from an existing Revit Element
wall:

Revit.Elements.FaceWall.#ctor(Autodesk.Revit.DB.WallLocationLine,Autodesk.Revit.DB.WallType,Autodesk.Revit.DB.Reference)
Create a new instance of WallType, deleting the original
location:
wallType:
reference:

Revit.Elements.FaceWall.InitFaceWall(Autodesk.Revit.DB.FaceWall)
Initialize a Wall element
wall:

Revit.Elements.FaceWall.InitFaceWall(Autodesk.Revit.DB.WallLocationLine,Autodesk.Revit.DB.WallType,Autodesk.Revit.DB.Reference)
Initialize a Wall element
location:
wallType:
reference:

Revit.Elements.FaceWall.InternalSetFaceWall(Autodesk.Revit.DB.FaceWall)
Set the internal Element, ElementId, and UniqueId
wall:

Revit.Elements.FaceWall.ByFace(Autodesk.Revit.DB.WallLocationLine,Revit.Elements.WallType,Autodesk.DesignScript.Geometry.Surface)
Create Wall By Face
locationLine:
wallType:
surface:
Returns:
Note: This is wrapped in Wall. FaceWalls will be created there.

Revit.Elements.FaceWall.ByFace(Autodesk.Revit.DB.WallLocationLine,Revit.Elements.WallType,Autodesk.Revit.DB.Reference)
Create Wall By Face
location:
wallType:
reference:
Returns:
Nots: This is for testing purposes only to directly use references from the Revit API

Revit.Elements.FaceWall.FromExisting(Autodesk.Revit.DB.FaceWall,System.Boolean)
Create a Revit FaceWall from an existing reference
wall:
isRevitOwned:
Returns: